In [4]:
import numpy as np
import pandas as pd

In [12]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

In [15]:
df = 
df.columns = ["STD, City", " State"]

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka

In [ ]:
#) ¿Cómo obtener la frecuencia de valores repetidos en todo el dataframe?

In [29]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))
df

   a  b  c  d
0  1  1  4  6
1  9  5  9  7
2  9  9  5  2
3  7  8  6  6
4  7  5  8  9

In [38]:
valores_repetidos = df[0].value_counts()
print(valores_repetidos)

4    3
3    3
2    3
1    3
Name: 0, dtype: int64

In [ ]:
#¿Cómo obtener las posiciones donde coinciden los valores de dos columnas?

In [40]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})

df

   fruit1  fruit2
0   apple   apple
1  orange   apple
2  banana   apple
3  banana  banana
4   apple  orange
5   apple  banana
6  banana   apple
7  banana  orange
8  orange   apple
9  banana  banana

In [53]:
artistas_filtro = df["fruit1"] == 'apple'
artistas_filtro.value_counts()

False    7
True     3
Name: fruit1, dtype: int64

In [64]:
pos1= df["fruit1"]
pos2 = df["fruit2"]   
print(pos1.values)
print(pos2.values)

arr1 = pos1.values
arr2= pos2.values

['apple' 'orange' 'banana' 'banana' 'apple' 'apple' 'banana' 'banana'
 'orange' 'banana']
['apple' 'apple' 'apple' 'banana' 'orange' 'banana' 'apple' 'orange'
 'apple' 'banana']

In [72]:
#) A partir de un diccionario crear un DataFrame

In [74]:
##{‘X’:[28,35,46,50,66], 'Y':[74,84,99,13,26],'Z':[36,47,56,62,73]}
##df =

In [75]:
#) Genere 3 columnas con 5 elementos cada uno. Cree una función para eliminar los N primeras o N últimas filas

In [80]:
arr = np.arange(15).reshape(5,3)

In [81]:
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [ ]:
#) Genere 5 columnas con 5 elementos cada uno. Cree una función para ordenar de forma ascendente o descendente los datos por columna.

In [83]:
arr = np.arange(25).reshape(5,5)
arr

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [91]:
df = pd.DataFrame(arr)
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [96]:
def ordenarValores(df):
    return df.sort_values([0, 1], ascending=[True, False])

In [101]:
#Genere 4 columnas con 5 elementos cada uno. Cree una función para obtener los N primeros o N ultimos registros.

In [103]:
arr = np.arange(20).reshape(5,4)
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [104]:
df= pd.DataFrame(arr)
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [106]:
def obtenerNPrimeros(n):
    return df.head(n)

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [108]:
def obtenerNUltimos(n):
    return df.tail(n)

    0   1   2   3
4  16  17  18  19

In [109]:
#Genere 4 columnas con 5 elementos cada uno. Cree una función para obtener los N primeros o N ultimos registros.

In [110]:
#igual q la anterior

In [111]:
#Genere 6 columnas con 5 elementos cada uno. Cree una función para obtener un nuevo DataFrame sin la columna X.

In [112]:
arr= np.arange(30).reshape(5,6)
arr

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11],
       [12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29]])

In [132]:
df= pd.DataFrame(arr)
df

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

In [133]:
def eliminarXColumna(x):
    df.drop(x)

    0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

In [ ]:
#Genere 3 columnas con 5 elementos cada uno. Cree una función para obtener el numero de columnas en un dataframe.

In [135]:
arr =  np.arange(15).reshape(5,3)
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [137]:
df= pd.DataFrame(arr)
df

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [142]:
df.columns.size

3

In [143]:
def numeroColumnas(df):
    return df.columns.size

In [144]:
numeroColumnas(df)

3

In [145]:
#Genere 2 columnas con 20 elementos cada uno. La primera columna debe de tener uno de los 
#siguientes valores: C1, C2, C3 y C4. Estos valores se pueden repetir. La segunda columna tiene valores de números cualesquiera. Cree una función para  agrupar por la Primera Columna y 
#que se listen los valores agrupados de la segunda Columna.

In [148]:
valores = pd.Series(np.random.choice(['C1', 'C2', 'C3' , 'C4'], 20))
valores

0     C4
1     C1
2     C2
3     C2
4     C4
5     C2
6     C3
7     C3
8     C3
9     C2
10    C3
11    C4
12    C3
13    C2
14    C1
15    C2
16    C3
17    C3
18    C3
19    C2
dtype: object

In [149]:
df = pd.DataFrame(valores)

In [150]:
df

     0
0   C4
1   C1
2   C2
3   C2
4   C4
5   C2
6   C3
7   C3
8   C3
9   C2
10  C3
11  C4
12  C3
13  C2
14  C1
15  C2
16  C3
17  C3
18  C3
19  C2

In [152]:
df2 = df.groupby

In [153]:
df2

<bound method NDFrame.groupby of      0
0   C4
1   C1
2   C2
3   C2
4   C4
5   C2
6   C3
7   C3
8   C3
9   C2
10  C3
11  C4
12  C3
13  C2
14  C1
15  C2
16  C3
17  C3
18  C3
19  C2>

In [154]:
#Cree una función para crear un DataFrame a partir 
#de una lista de listas. Suponga que la lista en la posicion 0 siempre son las cabeceras.

In [169]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
my_lists[0]
my_lists[1:]

[[2, 4], [1, 3]]

In [172]:
def crearDataFrame(lista):
    return pd.DataFrame(lista[1:], columns=lista[0])

In [173]:
crearDataFrame(my_lists)

   col1  col2
0     2     4
1     1     3

In [156]:
#Escriba una funcion que inserte en un indice especifico una nueva columna de 
#datos en un DataFrame.  Cree un DataFrame de ejemplo para probar su funcion

In [184]:
arr = np.arange(12).reshape(4,3)
df=pd.DataFrame(arr)
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [185]:
columnas = list(df)
columnas

[0, 1, 2]

In [157]:
#Escriba una funcion para eliminar los valores de numpy “inf”, “-inf” es decir Infinite Positive e Infinite negative
#de un dataframe por NaN. Cree un DataFrame de ejemplo para probar su funcion.

In [158]:
#Cree una funcion para cambiar strings o flotantes a tipo de dato entero de una columna y
#booleanos a 0 si es falso o 1 si es verdadero (tambien debe de quedar cambiada la columna a tipo entero).
#Cree un DataFrame de ejemplo para probar su funcion. Aqui un posible ejemplo:

In [ ]:
#Escriba una funcion para ordenar un dataframe por 2 o mas columnas. Cree un DataFrame de ejemplo para probar su funcion.

In [203]:


def ordenarValoresDataFrame(df, columnas, ordenarValores):
    return df.sort_values(columnas, ascending=ordenarValores)

In [206]:
arr =  np.arange(15).reshape(5,3)
df= pd.DataFrame(arr)
df
columnas=[0,1]
columnas
ordenar=[True, False]

In [208]:
ordenarValoresDataFrame(df, columnas=columnas, ordenarValores=ordenar)

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [186]:
#Escriba una funcion para buscar en que columnas se repite cierto
#valor y cuales no. Cree un DataFrame de ejemplo para probar su funcion.

In [216]:

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [10]))

df = pd.DataFrame(ser)
df

   0
0  3
1  1
2  4
3  4
4  3
5  2
6  3
7  4
8  2
9  2

In [221]:
valores_repetidos = df[0].value_counts()
print(valores_repetidos)

4    3
3    3
2    3
1    1
Name: 0, dtype: int64

In [224]:
valores_repetidos.index

Int64Index([4, 3, 2, 1], dtype='int64')

In [187]:
#Escriba una funcion para listar los valores minimos o maximos de toda la columna de un subconjunto de columnas. El programa debe de devolver el nombre de la columnas y el arreglo de indices de fila de los valores minimos y maximos. 
#Cree un DataFrame de ejemplo para probar su funcion.

In [ ]:
#Escriba una funcion que reciba como parametro un arreglo de nombres de columna y devuelva un diccionario de columnas con los valores de esa columna como “lista”. 
#El tipo de dato del valor de cada elemento del diccionario debe ser “lista”.

In [ ]:
#Escriba una funcion que reciba como parametros el numero de filas y que devuelva la selección de un subconjunto de 
#elementos randomicos del DataSet.